{
  "videos": [
    {
      "id": 1,
      "titulo": "Como fazer SEO com React, NextJS e Deploy estático",
      "descricao": "Eu to aqui pra nesse vídeo dizer que a gente vai aprender a começar uma app inspirada no desenho Pokémon com Nextjs e React, ver algumas dicas sobre performance e de quebra conhecer uma plataforma sensacional pra fazer deploy que é a Vercel.",
      "capa": "https://i.postimg.cc/fTVPYLPr/Como-fazer-SEO-com-React.jpg",
      "link": "https://www.youtube.com/embed/c8mVlakBESE?si=J763gQxcB6bLMH_r",
      "categoria": "Front-End"
    },
    {
      "id": 2,
      "titulo": "O que faz uma desenvolvedora front-end?",
      "capa": "https://i.postimg.cc/Kvry14gh/O-que-faz-uma-desenvolvedora-front-end.jpg",
      "descricao": "O que é Front-end? Trabalhando na área os termos HTML, CSS e JavaScript fazem parte da rotina das desenvolvedoras e desenvolvedores. Mas o que eles fazem, afinal? Descubra com a Vanessa nesse episódio!",
      "link": "https://www.youtube.com/embed/ZY3-MFxVdEw?si=vNWRWRS5FXxQabqC",
      "categoria": "Front-End"
    },
    {
      "id": 3,
      "titulo": "Guia de carreira React JS",
      "capa": "https://i.postimg.cc/4dfTbGCF/Guia-de-carreira-React-JS.jpg",
      "descricao": "Terceiro episódio da temporada! Com o Guia de Carreira React, aprenda o que é e como funciona essa biblioteca JavaScript, desde os fundamentos com HTML, CSS e JS, até os próximos níveis mais profundos, como React Hooks, Lazy Loading e Rotas, TypeScript, Testes, Redux e muito mais!",
      "link": "https://www.youtube.com/embed/0tS4lUq_7iA?si=VQ1YtzzpL2qgoXgk",
      "categoria": "Front-End"
    },
    {
      "id": 4,
      "titulo": "O que é e o que faz quem trabalha com UX?",
      "capa": "https://i.postimg.cc/D0c6QVT5/O-que-e-o-que-faz-quem-trabalha-com-UX.jpg",
      "descricao": "Chegou o episódio com a musa brasileira de UX, a Carla de Bona! Entenda a Experiência do Usuário e porque ela é importante para qualquer negócio, seja de produtos ou serviços. ",
      "link": "https://www.youtube.com/embed/FJhMCi07T4A?si=EIOjbjMM-tlvmEru",
      "categoria": "Front-End"
    },
    {
      "id": 5,
      "titulo": "Guia de Carreira PHP",
      "capa": "https://i.postimg.cc/mD9BgjsT/Guia-de-Carreira-PHP.jpg",
      "descricao": "8º ep. da Temporada! Com o Guia de Carreira PHP, aprenda o que é e para que serve essa linguagem de programação e saiba o que ela faz desde o Back-End até o Front-End (com Desenvolvimento Web).",
      "link": "https://www.youtube.com/embed/ETohL_o3SEI?si=Q2H4CZvgwf4d8Jqs",
      "categoria": "Back-End"
    },
    {
      "id": 6,
      "titulo": "O que é Node JS?",
      "capa": "https://i.postimg.cc/0jfphprC/O-que-Node-JS.jpg",
      "descricao": "Neste episódio do Hipsters.tube, Mario Souto e Paulo Silveira conversam sobre o Node .JS, eles explicam o que essa plataforma tão utilizada no universo Front-end faz, como ela surgiu e quais são suas aplicações.",
      "link": "https://www.youtube.com/embed/GKR6uSvEj8w?si=IArkquBJ0N-6tQZS",
      "categoria": "Back-End"
    },
    {
      "id": 7,
      "titulo": "Guia de Carreira JAVA",
      "capa": "https://i.postimg.cc/qv57BQF5/Guia-de-Carreira-JAVA.jpg",
      "descricao": "4º ep. da temporada! Com o Guia de Carreira Java, saiba o que é e para que serve o Java e descubra o passo a passo para sair do INICIANTE ao AVANÇADO. Desde os fundamentos e a Orientação a Objetos (POO), passando por testes, pacotes e coleções, até mergulhos mais profundos nessa linguagem de programação que você vai se interessar, como: Spring Framework e Spring Boot, velocidade de Compilação, JVM, Maven, Padrões de Projeto, SOLID, SQL, Kafka, Microsserviços, JUnit, Mock, Git, GitHub e muito mais!",
      "link": "https://www.youtube.com/embed/TUBqH9zVs3M?si=IO9mPXFqlyhMFUF2",
      "categoria": "Back-End"
    },
    {
      "id": 8,
      "titulo": "Desenvolvimento Android",
      "capa": "https://i.postimg.cc/Yqc9WnGP/Desenvolvimento-Android.jpg",
      "descricao": "Um episódio focado no desenvolvimento de aplicações Android. Neste bate-papo, Paulo Silveira e Felipe Torres conversam sobre os primeiros passos para começar a desenvolver, quais as principais ferramentas do desenvolvimento mobile, como colocar sua aplicação no ar e mais! ",
      "link": "https://www.youtube.com/embed/fWscDFHKgw8?si=KZ6_cqziuJaUYSdo",
      "categoria": "Mobile"
    },
    {
      "id": 9,
      "titulo": "Desmistificando Mobile- Por onde eu começo?",
      "capa": "https://i.postimg.cc/vBS9WrFm/Desmistificando-Mobile-Por-onde-eu-come-o.jpg",
      "descricao": "A Websérie “Desmistificando o mobile” vêm aí para simplificar com exemplos práticos vários assuntos envolvendo o mundo dos aplicativos de celular e neste primeiro episódio vamos partir, literalmente, do começo, por onde começar a estudar sobre o mundo dos apps? Os instrutores da escola de mobile da Alura nos ajudam com essa tarefa.",
      "link": "https://www.youtube.com/embed/2z6f8VN_Pro?si=kbSon5NYShNRdVm5",
      "categoria": "Mobile"
    },
    {
      "id": 10,
      "titulo": "Guia de Carreira: Android",
      "capa": "https://i.postimg.cc/BQssTXsT/Guia-de-Carreira-Android.jpg",
      "descricao": "Mergulhe na área de desenvolvimento para mobile e explore o mundo do Android e Kotlin com Tech Guida da Alura.",
      "link": "https://www.youtube.com/embed/Jt6cRnki-IE?si=Yjro1MZilSJVjU1k",
      "categoria": "Mobile"
    }
  ]
}

